[
    "Which tools can you use?",
    "What can you do with images?",
    "Compare Amazon Bedrock and Amazon SageMaker. Look at their product pages.",
    "Compare today's news on the CNN and BBC websites.",
    "Things to do in London this weekend. Look for specific websites and pages.",
    "Tell me a nice Japanese restaurant in Putney, London.",
    "Compare the styles of the directors of Interstellar and Arrival.",
    "How many prime numbers between 1 and 10, 1 and 100, and so on up to one million?",
    "Tell me 10 right triangles with integer lengths and at least one side that is a prime number.",
    "Generate the image of a dog on a bike and of a cat driving a fast car.",
    "Find an image with a dog.",
    "Download an image of the Roman Colosseum.",
    "Write a long multi-page article about computing Pi with numerical methods in Python. Run all code snippets and add their outputs and visualizations to the article.",
    "Generate an image for the article's cover.",
    "You're a ML expert. Write a five-page article explaining multimodal embeddings and how they are trained to an audience of software engineers with no ML experience. Look for recent (2024) articles and info on the topic. Start with the index and then write all sections. Add visualizations. Review the article from the perspective of a technical editor.",
    "Write a multi-page article about testing non-deterministic software. Look for established best practices and recent (2024) innovations. Find interesting research papers in this area. First, focus on the general problem. Then, dive deep into integrating LLMs into an application. Add images, charts, and diagrams to better explain those concepts. Include practical examples in Python. Include public anecdotes.",
    "Read the latest AWS news from the AWS News Blog and the \"What's new with AWS\" page, group them by category (such as compute, storage, networking, databases, security, etc.), and put them in an audio conversation.",
    "Read the history of how Rome was founded from Wikipedia and put it in an audio conversation.",
    "Tell a joke in an audio conversation.",
    "What's the minimum mass for a rocket to reach the Moon? Make a chart.",
    "Solve this equation: x^3 -x^2 + x - 1 = 0"
]